Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: The "compulsory" field indicates whether this attribute will be compulsorily applied to any added keys (irrespective of whether the attribute has been specified by the client) due to administrative settings on the server.
ja: "compulsory" フィールドは, サーバの管理の設定のため, 追加されるどの鍵にも(クライアントがこの属性を指定しているかに関係なく)この属性が強制的に追加されることを示している.

source: Channels are identified by numbers at each end.
ja: チャンネルは両方の側で番号によって識別される.

source: For example, there is a theoretical privacy attack against stateful-decryption counter mode if an adversary is allowed to encrypt approximately 2**(L/2) messages with the same key.
ja: 例えば, 同じ鍵でおおよそ 2**(L/2)のメッセージを暗号化すると, ステートフル復号カウンターモードに対する理論的な秘匿性への攻撃ができる.

source: Authentication
ja: 認証

source: Because public key authentication exchanges are cryptographically bound to the session (i.e., to the initial key exchange), they cannot be successfully replayed in other sessions.
ja: 公開鍵認証の交換が暗号学的にセッションと(すなわち最初の鍵交換と)束縛しているので, 別のセッションでのリプレイを成功させることができない.

source: Threats
ja: 脅威

source: For example, instead of an instruction field of "Enter Password" and a prompt field of "Password for user23@host.domain: ", a better choice might be an instruction field of "Password authentication for user23@host.domain" and a prompt field of "Password: ".
ja: 例えば, instruction フィールドに"Enter Password", prompt フィールドに"Password for user23@host.domain: " とする代わりに, instruction フィールドに "Password authentication for user23@host.domain" , prompt フィールドに "Password: " とするのが良い選択だ..

source: Upon receiving a request message, the client SHOULD prompt the user as follows:
ja: 要求メッセージを受け付けたら, クライアントは次のようにユーザにプロンプトを出す必要がある.

source: For data that is normally displayed, it SHOULD be possible to fetch a localized message instead of the transmitted message by using a numerical code.
ja: 通常表示されるデータに対して, 転送されるメッセージの代りに地域化されたメッセージを数値コードを用いて取得できるようにする必要がある.

source: The SSH host public key algorithm name "null", to name the NULL host key algorithm defined in Section 5.
ja: SSH ホスト公開鍵アルゴリズム名 "nulll" で, 5 節で定義した ヌルホスト鍵アルゴリズムを指定する.

source: The "idea-cbc" cipher is the IDEA cipher in CBC mode [SCHNEIER].
ja: "idea-cbc" 暗号は, CBCモードの IDEA 暗号だ [SCHNEIER].

source: Security Considerations ........................................13 9.1.
ja: セキュリティの考察 ........................................13 9.1.

source: This method is defined as a single message:
ja: この認証法は, 単一のメッセージで定義される.

source: IANA Considerations ...........................................17 12.
ja: IANAの考慮 ...........................................17 12.

source: First, the server sends:
ja: サーバは最初に以下を送信する:

source: When NETCONF is run over SSH using the mapping defined in this document, the client is always the manager, and the server is always the agent.
ja: この文書で定義されたマッピングを用いて SSH の上で NETCONF を動作させる場合は, クライアントは常にマネージャでサーバは常にエージェントだ.

source: The assigned keywords and port numbers are "snmpssh" (5161) and "snmpssh-trap" (5162).
ja: 割り当てられたキーワードとポート番号は "snmpssh" (5161) と "snmpssh-trap" (5162) だ.

source: MAC algorithms (both client_to_server and server_to_client) AEAD_AES_128_GCM [SSH-GCM] AEAD_AES_256_GCM [SSH-GCM]
ja: MAC アルゴリズム (client_to_server と server_to_client の両方) AEAD_AES_128_GCM [SSH-GCM] AEAD_AES_256_GCM [SSH-GCM]

source: The server MUST NOT send another SSH_MSG_USERAUTH_INFO_REQUEST before it has received the answer from the client.
ja: クライアントからの返答を受け取る前に, サーバは別の SSH_MSG_USERAUTH_INFO_REQUEST を送ってはならない.

source: While it is technically possible to support no authentication and no encryption in SSH, it is NOT RECOMMENDED by [RFC4253].
ja: 技術的にはSSHで認証や暗号化をサポートしないのは可能だが, [RFC4253]で推奨されていない.

source: Conceptual Differences between USM and SSHTM
ja: USM と SSHTM の概念的な違い

source: Textual Conventions
ja: テキスト表記法

source: One design goal has been to keep the base protocol as simple as possible, and to require as few algorithms as possible.
ja: 設計の目標の1つは, 基本のプロトコルを可能な限りシンプルに保ち必要なアルゴリズムを可能な限り少なくすることだ.

source: The public key and the SSHFP resource record are matched together by comparing algorithm number and fingerprint.
ja: アルゴリズム番号と指紋を比較して, 公開鍵と SSHFP リソースレコードが一致するか調べる

source: The following are some examples of public key files that are compliant (note that the examples all wrap before 72 bytes to meet IETF document requirements; however, they are still compliant.)
ja: 以下は準拠する公開鍵ファイルの例だ. (注意: IETF の文書の要件を満すために すべての例は72 byte より前で折り返されている. ただし, これでも準拠している)

source: This method name gives a hashing algorithm that is to be used for the Hashed Message Authentication Code (HMAC) below.
ja: この名前は, 以下のHMACで用いられるハッシュアルゴリズムを与える.

source: This last form executes a predefined subsystem.
ja: この最後の形式は, 先に定義されたサブシステムを実行する.

source: If a user accepts a key without verifying the fingerprint with something learned through a secured channel, the connection is vulnerable to a man-in-the-middle attack.
ja: 安全なチャンネルから得た公開鍵の指紋を検証しないでユーザが鍵を受け入れると, その接続は中間者攻撃に対して脆弱だ.

source: PFS is a major design goal of SSH, and any well-designed key-exchange algorithm will provide it.
ja: PFS は SSH の主な設計目標で, うまく設計された鍵交換アルゴリズムは PFS を提供する.

source: The securityName prefix to be associated with the snmpSSHDomain is 'ssh'.
ja: snmpSSHDomain に関連する securityName 接頭辞は 'ssh' だ.

source: This section describes a user authentication method building on the framework described in [SSH-USERAUTH].
ja: この節では, [SSH-USERAUTH] で記述されたフレームワーク上に構築するユーザ認証法を記述する.

source: This protocol provides a secure encrypted channel over an insecure network.
ja: このプロトコルは, 安全でないネットワーク上で安全な暗号化されたチャンネルを提供する.

source: Key data MUST be taken from the beginning of the hash output.
ja: 鍵データは, ハッシュの出力の先頭から取得されなければならない.

source: Properties of Galois Counter Mode
ja: Galois カウンタモードの特性

source: Of course, there is no guarantee that a pre-established session will still be valid when needed.
ja: もちろん, 事前に確立されたセッションが 必要な際にまだ有効化どうかの保証はない.

source: The repercussions of this decision are discussed in the following Security Considerations section.
ja: この決定の影響は, 次のセキュリティの考察の節で議論する.

source: ecdh-sha2-nistp384 ephemeral-ephemeral elliptic curve Diffie-Hellman on nistp384 with SHA-384
ja: ecdh-sha2-nistp384 SHA-384 を用いる nistp384 の一時-一時楕円曲線 Diffie-Hellman

source: 2 when p (mod 24) = 11.
ja: 2 p (mod 24) = 11 のとき.

source: One possible implementation strategy of the submethods field on the server is that, unless the user may use multiple different submethods, the server ignores this field.
ja: submethods フィールドのサーバ側の一つの可能な実装戦略は, ユーザが複数の異なる submethodを利用しようとも, サーバがこのフィールドを無視することだ.

source: Such data can be passed with SSH_MSG_CHANNEL_EXTENDED_DATA messages, where a separate integer specifies the type of data.
ja: このようなデータは, SSH_MSG_CHANNEL_EXTENDED_DATA メッセージによって転送される. ここで異なる integer によってデータの種類を指定する.

source: If this condition is violated, the key exchange fails.
ja: この条件が破られたら, 鍵交換は失敗する.

source: Traffic Analysis ...................................21 9.4.
ja: トラフィック解析 ...................................21 9.4.

source: If the last character of a line is a '\', then the logical contents of the line are formed by removing the '\' and the line termination characters, and appending the contents of the next line.
ja: 最後の行の文字が '\' の場合, '\' と行終端文字を除いて次の行の内容を連結したものがその行の論理的な内容となる.

source: The 'service name' for this protocol is "ssh-connection".
ja: このプロトコルの 'service name' は, "ssh-connection" だ.

source: This recommendation is designed to minimize the risk of birthday attacks against the encryption method's underlying block cipher.
ja: この推奨は, 暗号法の基底のブロック暗号に対する誕生日攻撃のリスクを最小限にするために設計されている.

source: Compliant implementations MUST function correctly if the quotation marks are omitted.
ja: この文書に準拠する実装は, 引用符がなくても正常に機能する必要がある.

source: The first algorithm in each name-list MUST be the preferred (guessed) algorithm.
ja: それぞれの名前リストの最初のアルゴリズムが, 優先する(推測する)アルゴリズムでなければならない.

source: Applications that require a shorter BREAK may choose to ignore this suggestion.
ja: より短い BREAKを必要とするアプリケーションは, この示唆を無視してもよい.

source: The "*-n" MACs use only the first n bits of the resulting value.
ja: "*-n" MACは, 結果の値の最初の n bit のみを利用する.

source: This allows some degree of machine-independence, at least between systems that use a POSIX-like tty interface.
ja: 少なくともPOSIX風のttyインタフェイスを利用するシステム間では, マシンに依存する部分があってよい.

source: Each method name is the concatenation of the string "ecdh-sha2-" with the elliptic curve domain parameter identifier as defined in Section 6.1.
ja: それぞれの方法の名前は, 文字列 "ecdh-sha2-" と 6.1節で定義した楕円曲線ドメインパラメータ識別子の連結だ.

source: Suite B SSH implementations MUST support AEAD_AES_GCM_128 and SHOULD support AEAD_AES_GCM_256 to both provide confidentiality and ensure data integrity.
ja: Suite B SSH 実装は, 機密性を提供しデータ完全性を保証するため, AEAD_AES_GCM_128 をサポートしなければならない. また, AEAD_AES_GCM_256 をサポートする必要がある.

source: Requesting Port Forwarding
ja: ポート転送の要求

source: Channels are flow-controlled.
ja: チャンネルはフロー制御される.

source: A client may request a list of authentication 'method name' values that may continue by using the "none" authentication 'method name'.
ja: クライアントは, 認証を続行する 'method_name'の値のリストに"none"を含めてもよい.

source: SSH maintains its own group identifier space that is logically distinct from Oakley [RFC2412] and IKE; however, for one additional group, the Working Group adopted the number assigned by [RFC3526], using diffie- hellman-group14-sha1 for the name of the second defined group.
ja: SSHは, Oakley [RFC2412] や IKE と論理的に異なる, 自身の群識別子を維持している. しかし, 追加の群として, ワーキンググループは[RFC3526] で割当てられた数を採用した. この2つ目の群の名前として, "diffie-hellman-group14-sha1" を用いる.

source: This format is the same as for ssh-rsa signatures in Section 6.6 of [RFC4253].
ja: [RFC4253] の 6.6 節の ssh-rsa 署名と, このフォーマットは同一だ.

source: 32 INPCK Enable checking of parity errors.
ja: 32 INPCK パリティエラーのチェックを有効にする.

source: The following table lists the initial assignments of the Connection Protocol Global Request Names.
ja: 次の表で, コネクションプロトコルのグローバルなリクエスト名の初期の割り当てを示す.

source: When either party wishes to terminate the channel, it sends SSH_MSG_CHANNEL_CLOSE.
ja: どちらかの側がチャンネルを終了したいと望むなら, SSH_MSG_CHANNEL_CLOSE を送る.

source: The channel needs to be closed with SSH_MSG_CHANNEL_CLOSE after this message.
ja: このメッセージの後の SSH_MSG_CHANNEL_CLOSE でチャンネルは閉じられる必要がある.

source: The padding SHOULD consist of random bytes.
ja: パディングは, ランダムなbyteで構成される必要がある.

source: Negotiation and initialization of a Suite B Secure Shell connection involves the following Secure Shell messages (where C->S denotes a message from the client to the server, and S->C denotes a server-to- client message):
ja: Suite B セキュアシェル接続の交渉と初期化は, 次のセキュアシェルメッセージで行なわれる (C->S はクライアントからサーバへのメッセージ, S->C はサーバからクライアントへのメッセージを意味する):

source: The "idea-ctr" method uses the IDEA cipher [SCHNEIER].
ja: "idea-ctr" は IDEA 暗号を用いる [SCHNEIER].

source: The Disconnection Message 'reason code' values in the range of 0xFE000000 through 0xFFFFFFFF are reserved for PRIVATE USE.
ja: 0xFE000000 から 0xFFFFFFFF の範囲の 'reason code' の値は, プライベートな利用(PRIVATE USE)に予約されている.

source: Note that the 'user name' value is encoded in ISO-10646 UTF-8.
ja: 注意： 'user name' の値は ISO-10646 UTF-8 でエンコードされる．

source: The SSH Transport Model thus fits between the underlying SSH transport layer and the Message Dispatcher [RFC3411].
ja: すなわち, SSH トランスポートモデルは, 基底のSSHトランスポート層と メッセージディスパッチャ [RFC3411] の間に適合する.

source: Note that even though the cleartext password is transmitted in the packet, the entire packet is encrypted by the transport layer.
ja: 暗号化されないパスワードがパケットに含まれて転送されるが, パケット全体はトランスポート層で暗号化されることを注記しておく.

source: After the ssh-connection service is established, the client will open a channel of type "session", which will result in an SSH session.
ja: ssh-connection サービスが確立したら, クライアントは SSHのセッションとなる "session" タイプのチャンネルを開始する.

source: The string [identifier] is the identifier of the elliptic curve domain parameters.
ja: 文字列 [identifier] は, 楕円曲線のドメインパラメータの識別子だ.

source: After receiving this message, the recipient MAY send the given number of bytes more than it was previously allowed to send; the window size is incremented.
ja: このメッセージを受け取ったら, 受け取り手は以前送る事を許可されていたものよりも指定されただけ大きいbyte数を送ってもよい; window size が増加する.

source: However, in order to use public key authentication in the SSH protocol, public keys must first be exchanged between client and server.
ja: SSHプロトコルで公開鍵認証を行なうためには, クライアントとサーバ間で最初に公開鍵を交換しなければならない.

source: Certain types of curves can be more susceptible to known attacks than others.
ja: 特定の種類の曲線は, 他のものよりも既知の攻撃に対して弱い可能性がある.

source: The SSH [6] protocol provides secure remote login and other secure network services over an insecure network.
ja: SSH [6] プロトコルは, 安全ではないネットワーク上での安全なログインや他の安全なネットワークサービスを提供する.

source: This message will request that the user's default shell (typically defined in /etc/passwd in UNIX systems) be started at the other end.
ja: このメッセージは, 相手側で( UNIX システムでは典型的に /etc/passwd で定義される) ユーザのデフォルトシェルの起動を要求する.

source: Fortunately, the common concerns with counter mode do not apply to SSH because of the rekeying recommendations and because of the additional protection provided by the transport protocol's MAC.
ja: 幸いにも, カウンターモードについての一般的な懸念はSSHには適用されない. 鍵の再生成の推奨とトランスポートプロトコルのMACで提供される追加の保護のおがけだ.

source: The particular case where this comes up is verifying that the server host key really belongs to the desired host; the protocol allows the verification to be left out, but this is NOT RECOMMENDED.
ja: この具体的な例が, サーバホスト鍵が本当に接続したいホストかどうかの検証にある. プロトコルは, 検証を省略することを許可している. しかし, これは推奨されないやり方だ.

source: For those interested, the only known documentation of the 1.x protocol is contained in README files that are shipped along with the source code [ssh-1.2.30].
ja: 興味のある者のために紹介しておくと, 1.x プロトコルについての唯一の文書は, ソースコード [ssh-1.2.30] と共にリリースされた README ファイルに含まれている.

source: 1 to 19 Transport layer generic (e.g., disconnect, ignore, debug, etc.) 20 to 29 Algorithm negotiation 30 to 49 Key exchange method specific (numbers can be reused for different authentication methods)
ja: 1 to 19 トランスポート層一般(例: 切断, 無視, デバッグなど 20 to 29 アルゴリズムのネゴシエーション 30 to 49 鍵交換方式ごとに特有(番号は, 異なる方式で再利用されてもよい)

source: o The sender's certificate MUST be the first certificate and the public key conveyed by this certificate MUST be consistent with the public key algorithm being employed to authenticate the sender.
ja: o 送信者の証明書は, 最初の証明書でなければならない. この証明書で運ばれる公開鍵は, 送信者を認証するのに採用された公開鍵アルゴリズムのものでなければならない.

source: When used over TCP/IP, the server normally listens for connections on port 22.
ja: TCP/IP上で利用する際, サーバは通常22番ポートで接続を待ち受ける.

source: This document describes the architecture of a Suite B compliant implementation of the Secure Shell Transport Layer Protocol and the Secure Shell Authentication Protocol.
ja: この文書は, セキュアシェルトランスポートプロトコルとセキュアシェル認証プロトコルの Suite B 準拠実装のアーキテクチャを記述する.

source: Structure of the MIB Module
ja: MIBモジュールの構造

source: Group Exchange ............................................10 2.3.
ja: 群の交換 ............................................10 2.3.

source: These messages are only sent by the server (client sends only SSH_MSG_USERAUTH_REQUEST messages).
ja: これらのメッセージはサーバからのみ送られる. (クライアントは,SSH_MSG_USERAUTH_REQUEST メッセージのみを送る.)

source: Other issues, such as which TCP/IP ports can be forwarded and by whom, are clearly issues of local policy.
ja: TCP/IPのポートが転送できるかや誰に許可されるかといった他の問題は, 明らかにローカルなポリシーの問題だ.

source: It is not normally included in the key blob.
ja: 通常, key blob には含まれない.

source: Named Elliptic Curve Domain Parameters
ja: 指定された楕円曲線ドメインパラメータ

source: Channel Connection Failure Reason Codes and Descriptions ...8 4.3.1.
ja: チャンネル接続失敗の reason code (理由コード)と description(説明)..8 4.3.1.

source: A second service request is sent after user authentication is complete.
ja: 2番目のサービスの要求は, ユーザ認証が完了してから送られる.

source: Capabilities Exchange ......................................3 4.
ja: 機能の交換 ......................................3 4.

source: Using the notation defined in [RFC5116], the input and output lengths for AEAD_AES_128_GCM in secure shell are as follows:
ja: [RFC5116] で定義された表記法を用いると, セキュアシェルでの AEAD_AES_128_GCMの入力長と出力長は以下となる:

source: Names MUST be case-sensitive.
ja: 名前は,大文字と小文字を区別しなければならない

source: The Secure Shell (SSH) Transport Layer Protocol
ja: セキュア シェル (SSH) トランスポート層プロトコル

source: Both sides send the highest version that they implement.
ja: クライアントもサーバも, 実装している最も高いバージョンを送る.

source: This is the only occasion on which the client sends a status message.
ja: これは, クライアントが状態メッセージを送る唯一の場合だ.

source: Implementations MUST reject these messages unless they have previously requested a remote TCP/IP port forwarding with the given port number.
ja: 実装は, このポート番号でのリモートのTCP/IPポート転送を先に要求していなければ, このメッセージを拒否しなければならない.

source: The information on implementing the HMAC based on the chosen hash algorithm can be found in [RFC2104].
ja: 選ばれたハッシュアルゴリズムに基づくHMACを実装するための情報は [RFC2104]にある.

source: It consists of three major protocol components and add-on methods for user authentication:
ja: 3つの主要なプロトコル要素とユーザ認証のための追加の方法で構成されている:

source: The numbers 30-49 are key exchange specific and may be redefined by other kex methods.
ja: 30-49 の範囲の数は鍵交換特有のもので, 他の鍵交換法で再定義できる.

source: The SSH Connection Protocol has been designed to run on top of the SSH transport layer and user authentication protocols.
ja: SSH コネクションプロトコルは, SSH トランスポート層・ユーザ認証プロトコル上で動作するように設計されている.

source: Compression Algorithm Names
ja: 圧縮アルゴリズム名

source: One specific scenario for having a configurable policy is where clients use unqualified host names to connect to servers.
ja: 設定可能なポリシーを持つ場合の特有のシナリオとして, クライアントが接続するサーバのFQDNを使わない場合がある.

source: ECMQV Message Numbers
ja: ECMQV メッセージ番号

source: If no algorithm satisfying all these conditions can be found, the connection fails, and both sides MUST disconnect.
ja: この条件を満たすアルゴリズムが見付からない場合は, 接続は失敗し, 両方の側が切断しなければならない.

source: 1) The server MUST share its public key with the host using an X.509v3 certificate as described in [SSH-X509].
ja: 1) サーバは, [SSH-X509] に記述されている X.509v3 証明書を用いてホストにその公開鍵を共有しなければならない.

source: Both parties use the following message to adjust the window.
ja: どちらの側も次のメッセージで window を調整できる.

source: ECDSA-256 only (min_LOS 128): server_host_key_algorithms name_list := { x509v3-ecdsa-sha2-nistp256 }
ja: ECDSA-256 のみ (min_LOS 128): server_host_key_algorithms name_list := { x509v3-ecdsa-sha2-nistp256 }

source: The format is as follows:
ja: 形式は以下の通り:

source: An example of an SSH key exchange involving one of these public key algorithms is given in Appendix A.
ja: これらの公開鍵アルゴリズムの1つでSSHの鍵交換をする例を, 付録Aで示す.

source: Encryption Algorithm Name Reference ------------------------- --------- 3des-cbc [SSH-TRANS, Section 6.3] blowfish-cbc [SSH-TRANS, Section 6.3] twofish256-cbc [SSH-TRANS, Section 6.3] twofish-cbc [SSH-TRANS, Section 6.3] twofish192-cbc [SSH-TRANS, Section 6.3] twofish128-cbc [SSH-TRANS, Section 6.3] aes256-cbc [SSH-TRANS, Section 6.3] aes192-cbc [SSH-TRANS, Section 6.3] aes128-cbc [SSH-TRANS, Section 6.3] serpent256-cbc [SSH-TRANS, Section 6.3] serpent192-cbc [SSH-TRANS, Section 6.3] serpent128-cbc [SSH-TRANS, Section 6.3] arcfour [SSH-TRANS, Section 6.3] idea-cbc [SSH-TRANS, Section 6.3] cast128-cbc [SSH-TRANS, Section 6.3] none [SSH-TRANS, Section 6.3] des-cbc [FIPS-46-3] HISTORIC; See page 4 of [FIPS-46-3]
ja: 暗号アロゴリズム名 Reference ------------------------- --------- 3des-cbc [SSH-TRANS, Section 6.3] blowfish-cbc [SSH-TRANS, Section 6.3] twofish256-cbc [SSH-TRANS, Section 6.3] twofish-cbc [SSH-TRANS, Section 6.3] twofish192-cbc [SSH-TRANS, Section 6.3] twofish128-cbc [SSH-TRANS, Section 6.3] aes256-cbc [SSH-TRANS, Section 6.3] aes192-cbc [SSH-TRANS, Section 6.3] aes128-cbc [SSH-TRANS, Section 6.3] serpent256-cbc [SSH-TRANS, Section 6.3] serpent192-cbc [SSH-TRANS, Section 6.3] serpent128-cbc [SSH-TRANS, Section 6.3] arcfour [SSH-TRANS, Section 6.3] idea-cbc [SSH-TRANS, Section 6.3] cast128-cbc [SSH-TRANS, Section 6.3] none [SSH-TRANS, Section 6.3] des-cbc [FIPS-46-3] HISTORIC; See page 4 of [FIPS-46-3]

source: The data types boolean, byte, uint32, uint64, string, and mpint are to be interpreted in this document as described in [RFC4251].
ja: データ型 boolean, byte, uint32, uint64, string, mpint は, [RFC4251] で記述されているように解釈される.

source: There are noticeable bandwidth and processing overheads to handling such window adjustment messages, which can be avoided by sending them less frequently.
ja: そのような window 調整メッセージを扱うには, 広い帯域と処理のオーバヘッドがある. あまり頻繁にメッセージを送らないようにしてこれらを避けることができる.

source: tmTransportSecurityLevel = "authPriv" (authentication and confidentiality MUST be used to comply with this Transport Model.)
ja: tmTransportSecurityLevel = "authPriv" (認証と機密性は, このトランスポートモデルに従って用いられなければならない)

source: Recommendation (1) states that SSH implementations should rekey at least once every 2**32 packets.
ja: 推奨 (1) は SSHの実装は少なくとも 2**32パケットごとに1度鍵の再生成をする必要があると主張している.

source: The existence of trusted host keys for different public key algorithms also affects this choice.
ja: 異なる公開鍵アルゴリズムを持つ複数の信頼されたホスト鍵が存在する場合もこの選択に影響する.

source: o Consistently used the term "operation", instead of "command" or "message".
ja: o "コマンド" や "メッセージ" の変わりに 用語 "操作" を一貫して利用するようにした.

source: When a connection comes to a port for which remote forwarding has been requested, a channel is opened to forward the port to the other side.
ja: リモートへの転送が要求されたポートに接続が来ると, 相手側のポートに転送をするチャンネルが開かれる.

source: If the client wishes to know which key attributes the server supports, it sends:
ja: クライアントがサーバのサポートする鍵の属性を知りたい場合, 以下を送る:

source: 93 PARODD Odd parity, else even.
ja: 93 PARODD 設定されると奇数パリティ. もしくは 偶数パリティ

source: It is RECOMMENDED that servers only include those 'method name' values in the name-list that are actually useful.
ja: サーバは, 実際に利用できる名前 'method_name' の値のみをリストに含めることが推奨される.

source: Two TCP port numbers in the Port Numbers registry that will be the default ports for the SNMP-over-SSH Transport Model as defined in this document, and the SNMP-over-SSH Transport Model for notifications as defined in this document.
ja: ポート番号レジストリの 2つの TCP ポート番号が, この文書で定義された SNMP オーバー SSH トランスポートモデルとこの文書で定義された通知のSNMP オーバー SSH トランスポートモデルのデフォルトのポートとなる.

source: This is more efficient than using two different ephemeral keys, and it does not adversely affect security (it is analogous to the one- pass protocol in Section 6.1 of [LMQSV98]).
ja: これは2つの一時的鍵を用いるより効率的で, セキュリティに不利に作用しない(これは, [LMQSV98] の 6.1節の one-passプロトコルに類似している.)

source: 80 to 89 Connection protocol generic 90 to 127 Channel related messages
ja: 80 to 89 コネクションプロトコル一般 90 to 127 チャンネルに関連したメッセージ

source: Extract the tmTransportDomain, tmTransportAddress, tmSecurityName, tmRequestedSecurityLevel, tmSameSecurity, and tmSessionID from the tmStateReference.
ja: tmTransportDomain, tmTransportAddress, tmSecurityName, tmRequestedSecurityLevel, tmSameSecurity, tmSessionID をtmStateReference から抽出する.

source: MAX-ACCESS read-only STATUS current DESCRIPTION "The number of outgoing messages dropped because the tmStateReference referred to an invalid cache.
ja: MAX-ACCESS read-only STATUS current DESCRIPTION "tmStateReference が不正なキャッシュを参照していたため送信メッセージがドロップされた回数.

source: If AES-GCM is selected as the encryption algorithm for a given tunnel, AES-GCM MUST also be selected as the Message Authentication Code (MAC) algorithm.
ja: AES-GCM がトンネルの暗号化アルゴリズムとして選択されたら, AES-GCMは, メッセージ認証コード (MAC) アルゴリズムとしても選択されなければならない.

source: For the most part, the SSH protocols do not directly pass text that would be displayed to the user.
ja: ほとんどの部分で, SSH プロトコルはユーザに表示されるテキストを直接には扱わない.

source: The "aes256-ctr" method uses AES with 256-bit keys.
ja: "aes256-ctr" は 256-bit の鍵を用いる ＡＥＳ を使う.

source: Non-Signature Primitives ...................................5 3.
ja: 署名以外のプリミティブ ...................................5 3.

source: Opcodes 1 to 159 have a single uint32 argument.
ja: Opcode の 1 から 159 までは単一のuint32の引数を持つ

source: Similar local naming policy is applied to the service names, as is applied to the algorithm names.
ja: アルゴリズム名に適用されているのと同様のローカルな名前付けのポリシーが, サービス名にも適用される.
